<?php

return [
    'title' => 'Дипломный проект третьей группы выпуска',
    'spring' => 'Весна',
    'academy' => 'Компьютерная академия',

    'about' => 'Про нас',
    'how_it_works' => 'Как это работает',
    'other' => 'Другое',

    'project' => 'О проекте',
    'contacts' => 'Контакты',
    'mobile' => 'Мобильная версия',
    'partners' => 'Для партнеров',

    'service' => 'Заказать услугу',
    'specialist' => 'Искать специалиста',
    'find' => 'Искать работу',
    'user-page' => 'Страница пользователя',

    'support' => 'Служба поддержки',
    'offer' => 'Публичная оферта',
    'q-a' => 'Вопрос-Ответ',
    'all'=>'Все категории',
];
