<?php

return [
    'home' => 'Главная',
    'roles_question' => 'Поиск специалистов или выгодных заказов',
    'specialists' => 'Найти специалиста',
    'orders' => 'Найти заказы',
    'any_questions' => 'Остались вопросы?',
    'support' => 'Служба поддержки',
    'online_service' => 'Онлайн-сервис заказа услуг',
    'declaration' => 'Более 100 000 проверенных специалистов для выполнения ваших бытовых или бизнес-задач',
    'how_works' => 'Как это работает?',
    'verified' => [
        'title' => 'Email успешно подтвержден',
        'description' => 'Ваш email был подтвержден. Теперь вы можете создать свой первый заказ.',
    ],
];
