<?php

return [
    'search_orders' => 'Поиск заказов',
    'favourite_specialists' => 'Избранные специалисты',
    'in_progress' => 'В работе',
    'new_task' => 'Новый заказ',

    'reviews' => 'отзывов',
    'positive' => 'положительных',

    'my_balance' => 'Мой баланс',
    'specialist' => 'Специалиста',
    'customer' => 'Заказчика',

    'extracts' => 'Выписки',
    'withdrawal' => 'Вывод средств с баланса',

    'invite_friends' => 'Расскажите друзьям',
    'invite_friends_text' => 'TaskSprint даёт работу тысячам украинцев. Расскажи о нём своим друзьям и получи плюс в карму!',

    'profile_link' => 'Ссылка на профиль',
    'profile_link_text' => 'Размещайте ссылку на ваш публичный профиль на других ресурсах, чтобы убедить клиентов в вашей компетентности и ответственности!',
    'copy_link' => 'Нажмите, чтобы скопировать ссылку',

    'copied' => 'Ссылка скопирована!',

    'general-info-tab' => 'Общая информация',
    'start-earning-tab' => 'Начать зарабатывать',
    'reviews-tab' => 'Отзывы',
];
