<?php

return [
    'title' => 'Видалити обліковий запис',
    'content' => 'Після видалення вашого облікового запису всі його ресурси та дані
                  будуть безповоротно видалені. Перед видаленням облікового запису
                  завантажте всі дані або інформацію, яку ви хочете зберегти.',
    'button' => 'Видалити обліковий запис',
    'confirmation' => [
        'title' => 'Ви впевнені, що хочете видалити свій обліковий запис?',
        'content' => 'Після видалення вашого облікового запису всі його ресурси та
                      дані будуть безповоротно видалені. Будь ласка, введіть свій
                      пароль, щоб підтвердити, що ви хочете безповоротно видалити
                      свій обліковий запис.',
        'password' => 'Пароль',
        'cancel' => 'Скасувати',
        'button' => 'Видалити обліковий запис',
    ]
];
