<?php

return [
    'title' => 'Інформація профілю',
    'content' => 'Оновіть інформацію профілю вашого облікового запису та адресу електронної пошти.',
    'name' => 'Ім\'я',
    'email' => 'Ел. пошта',
    'verification' => [
        'content' => 'Ваша електронна адреса не підтверджена.',
        'sent' => 'Нове посилання для підтвердження було надіслано на вашу електронну адресу.',
        'button' => 'Натисніть тут, щоб повторно надіслати лист з підтвердженням.',
    ],
    'button' => 'Зберегти',
    'saved' => 'Збережено.',
];
