<?php

return [
    'title' => 'Подтверждение электронной почты',
    'content' => 'Спасибо за регистрацию! Прежде чем начать, не могли бы вы
                  подтвердить свой адрес электронной почты, перейдя по ссылке,
                  которую мы только что отправили вам? Если вы не получили
                  письмо, мы с удовольствием отправим вам другое.',
    'resend' => [
        'button' => 'Отправить письмо для подтверждения',
        'sent' => 'Новая ссылка для подтверждения была отправлена на адрес
                   электронной почты, указанный вами при регистрации.',
    ],
    'button' => 'Выйти',
];
