<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Мовні рядки аутентифікації
    |--------------------------------------------------------------------------
    |
    | Наступні мовні рядки використовуються під час аутентифікації для різних
    | повідомлень, які нам потрібно показати користувачеві. Ви можете вільно
    | змінювати ці мовні рядки відповідно до вимог вашого застосунку.
    |
    */

    'failed' => 'Ці облікові дані не збігаються з нашими записами.',
    'password' => 'Наданий пароль невірний.',
    'throttle' => 'Забагато спроб входу. Будь ласка, спробуйте ще раз через :seconds секунд.',

];
