<?php

return [
    'title' => 'Підтвердження електронної пошти',
    'content' => 'Дякуємо за реєстрацію! Перш ніж почати, підтвердіть свою електронну адресу,
                  перейшовши за посиланням, яке ми щойно надіслали вам.
                  Якщо ви не отримали листа, ми з радістю надішлемо вам інший.',
    'resend' => [
        'button' => 'Надіслати лист для підтвердження',
        'sent' => 'Нове посилання для підтвердження було надіслано на електронну адресу,
                   яку ви вказали під час реєстрації.',
    ],
    'button' => 'Вийти',
];
