<?php

return [
    'set_default' => 'Сделать по умолчанию',
    'username' => 'Имя пользователя',
    'name' => 'Имя профиля',
    'phone' => 'Номер телефона',
    'email' => 'Электронная почта',
    'city' => 'Местоположение',
    'preferred_hours' => 'Предпочтительное время',
    'specialization' => 'Специализация',
    'about_me' => 'Описание',
    'education' => 'Образование',
    'certificates' => 'Сертификаты',

    'save_changes' => 'Сохранить изменения',
    'delete_profile' => 'Удалить профиль',

    'delete_profile_confirmation_title' => 'Вы действительно хотите удалить профиль?',
    'delete_profile_confirmation_subtitle' => 'Это действие необратимо. Подтвердите свою личность, введя пароль:',

    'save_changes_confirmation_title' => 'Изменения отправлены на проверку',
    'save_changes_confirmation_subtitle' => 'Внесённые вами изменения в поля «Образование» и «Сертификаты» требуют времени на проверку. После одобрения обновленная информация будет отображена в вашем профиле.',

    'field_missing' => 'Отсутствует поле',
];
