<?php

return [
    'title' => 'Удалить аккаунт',
    'content' => 'После удаления вашей учетной записи все ее ресурсы и данные
                  будут безвозвратно удалены. Перед удалением учетной записи
                  загрузите все данные или информацию, которые вы хотите сохранить.',
    'button' => 'Удалить аккаунт',
    'confirmation' => [
        'title' => 'Вы уверены, что хотите удалить свою учетную запись?',
        'content' => 'После удаления вашей учетной записи все ее ресурсы и данные
                      будут безвозвратно удалены. Пожалуйста, введите ваш пароль,
                      чтобы подтвердить, что вы хотите безвозвратно удалить свою
                      учетную запись.',
        'password' => 'Пароль',
        'cancel' => 'Отмена',
        'button' => 'Удалить аккаунт',
    ]
];
