<?php

return [
    'title' => 'Информация профиля',
    'content' => 'Обновите информацию профиля вашего аккаунта и адрес электронной почты.',
    'name' => 'Имя',
    'email' => 'Эл. почта',
    'verification' => [
        'content' => 'Ваш адрес электронной почты не подтвержден.',
        'sent' => 'Новая ссылка для подтверждения была отправлена на ваш адрес электронной почты.',
        'button' => 'Нажмите здесь, чтобы повторно отправить письмо с подтверждением.',
    ],
    'button' => 'Сохранить',
    'saved' => 'Сохранено.',
];
