<?php

return [
    'title' => 'Дипломний проект третьої групи випуску',
    'spring' => 'Весна',
    'academy' => 'Комп`ютерна академія ',

    'about' => 'Про нас',
    'how_it_works' => 'Як це працює',
    'other' => 'Інше',

    'project' => 'Про проект',
    'contacts' => 'Контакти',
    'mobile' => 'Мобільний застосунок',
    'partners' => 'для партнерів',

    'service' => 'Замовити послугу',
    'specialist' => 'Шукати фахівця',
    'find' => 'Шукати роботу',
    'user-page' => 'Сторинка користувача',

    'support' => 'Служба підтримки',
    'offer' => 'Публічна оферта',
    'q-a' => 'Запитання-Відповіді',
    'all'=>'Всі категорії',
];
