<?php

return [
    'task' => [
        'create' => [
            'title' => 'Створіть замовлення',
            'description' => 'Детально опишіть, що і коли потрібно зробити'
        ],
        'close' => [
            'title' => 'Закрийте замовлення',
            'description' => 'Залиште відгук та оцінку за виконану роботу'
        ]
    ],
    'employee-receive' => [
        'title' => 'Фахівець отримає завдання',
        'description' => 'І зв’яжеться з вами для обговорення деталей'
    ]
];
