<?php

return [
    'home' => 'Головна',
    'roles_question' => 'Шукайте фахівців або вигідні замовлення',
    'specialists' => 'Шукати фахівців',
    'orders' => 'Шукати замовлення',
    'any_questions' => 'Залишились питання?',
    'support' => 'Служба підтримки',
    'online_service' => 'Онлайн-сервіс замовлення послуг',
    'declaration' => 'Більше 100 000 перевірених фахівців для виконання ваших побутових або бізнес-завдань',
    'how_works' => 'Як це працює?',
    'verified' => [
        'title' => 'Email успішно підтверджено',
        'description' => 'Ваш email був підтверджений. Тепер ви можете створити своє перше замовлення.',
    ],
];
