<?php

return [
    "title"=> "Створіть нове замовлення",
    "description"=> "Привіт, швидше створюйте замовлення та впродовж 10 хвилин ми знайдемо кращого фахівця.",
    "create_task_button"=> "Створити замовлення",
    "popular_tasks" => "Популярні замовлення",
    "popular_tasks_description" => "Ви можете використовувати будь-яке замовлення, як шаблон",
    "completed_today_by" => "Виконано сьогодні фахівцем :customer",
    "repeat-task" => "Повторити замовлення",
    "view-task" => "Подивитись замовлення",
];
