<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Мовні рядки для скидання пароля
    |--------------------------------------------------------------------------
    |
    | Наступні мовні рядки є типовими повідомленнями, які відповідають причинам,
    | що надаються брокером паролів при спробі оновлення пароля, наприклад,
    | невірний токен скидання або невідповідний новий пароль.
    |
    */

    'reset' => 'Ваш пароль було скинуто.',
    'sent' => 'Ми надіслали вам посилання для скидання пароля.',
    'throttled' => 'Будь ласка, зачекайте перед повторною спробою.',
    'token' => 'Цей токен скидання пароля є недійсним.',
    'user' => 'Ми не можемо знайти користувача з такою електронною адресою.',

];
