<?php

return [
    'search_orders' => 'Пошук замовлень',
    'favourite_specialists' => 'Обрані фахівці',
    'in_progress' => 'В роботі',
    'new_task' => 'Нове замовлення',

    'reviews' => 'відгуків',
    'positive' => 'позитивних',

    'my_balance' => 'Мій баланс',
    'specialist' => 'Фахівця',
    'customer' => 'Замовника',

    'extracts' => 'Виписки',
    'withdrawal' => 'Виведення коштів з балансу',

    'invite_friends' => 'Розкажіть друзям',
    'invite_friends_text' => 'TaskSprint надає роботу тисячам українців. Розкажи про нього своїм друзям та отримай плюс у карму!',

    'profile_link' => 'Посилання на профіль',
    'profile_link_text' => 'Розміщуйте посилання на інших ресурсах на ваш публічний профіль для переконання клієнтів у вашій компетентності та відповідальності!',
    'copy_link' => 'Натисніть, щоб скопіювати посилання',

    'copied' => 'Посилання скопійоване!',

    'general-info-tab' => 'Загальна інформація',
    'start-earning-tab' => 'Почати заробляти',
    'reviews-tab' => 'Відгуки',
];
